class QuestionsAboutImportantData:
    text0 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    text1 = ("Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто "
             "сделать несколько заказов — один за другим.")
    text2 = ("Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды "
             "начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, "
             "суточная аренда закончится 9 мая в 20:30.")
    text3 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    text4 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    text5 = ("Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься "
             "без передышек и во сне. Зарядка не понадобится.")
    text6 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    text7 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class YaScooterOrderData:
    data_sets = {
        'data_set_1': {
            'name': 'Дейнерис',
            'surname': 'Таргариен',
            'address': 'Королевская улица',
            'station': 'Беговая',
            'phone_number': '79990001122',
            'date': '25.05.2024',
            'rent_time': 1,
            'color': [0],
            'comment_for_courier': 'Сижу на драконе, подходите с хвоста',
            'description': 'Корректные данные'
        },
        'data_set_2': {
            'name': 'Саурон',
            'surname': 'Морготович',
            'address': 'Первая линия Мордорского тракта',
            'station': 'Лубянка',
            'phone_number': '79990003344',
            'date': '26.05.2024',
            'rent_time': 3,
            'color': [0, 1],
            'comment_for_courier': 'Черный самокат, оставьте у чёрных врат',
            'description': 'Корректные данные'
        },
    }
